<h1>Interview Questions</h1>

<h3>1</h3> Given a list with missing values:

L = [10, , 8, -5 , , 20]

• select: “-1” for the missing values

• with / without loops (desirable with no loops)

In [82]:
#! pip install pandas

In [85]:
import pandas as pd
L=[10,None,8,-5,None,20]
df = pd.DataFrame(L, columns = ["my_list"])
df

   my_list
0     10.0
1      NaN
2      8.0
3     -5.0
4      NaN
5     20.0

In [77]:
df.isnull()

0    10.0
1    -1.0
2     8.0
3    -5.0
4    -1.0
5    20.0
Name: my_list, dtype: float64

In [79]:
#without loop
df1 = df.my_list.fillna(-1)
df1

0    10.0
1    -1.0
2     8.0
3    -5.0
4    -1.0
5    20.0
Name: my_list, dtype: float64

In [108]:
L
range(len(L))
L[5]

20

In [123]:
#with loop
for x in range(len(L)):
    if L[x]== None:
        L[x] = -1       
L

[10, -1, 8, -5, -1, 20]

<h3>2</h3>
Find second highest from each rows and columns

In [12]:

import numpy as np
import pandas as pd
np.random.seed(100)
df = pd.DataFrame(np.random.randint(10, size=(5,5)), columns=list('ABCDE'))
print(df)

   A  B  C  D  E
0  8  8  3  7  7
1  0  4  2  5  2
2  2  2  1  0  8
3  4  0  9  6  2
4  4  1  5  3  4

In [72]:
#first and second largest
pd.DataFrame(np.sort(df.values,axis=1)[:,-2:],columns=['2nd Largest','Largest'])

   2nd Largest  Largest
0            8        8
1            4        5
2            2        8
3            6        9
4            4        5

In [67]:
pd.DataFrame(np.sort(df.values,axis=1)[:,-1],columns=['1nd Largest'])

   1nd Largest
0            8
1            5
2            8
3            9
4            5

In [19]:
pd.DataFrame(np.sort(df.values,axis=1)[:,2],columns=['2nd Lowest'])

   2nd Lowest
0           7
1           2
2           2
3           4
4           4

Find second highest from each column???

In [65]:
df.nlargest(1,'A')

   A  B  C  D  E
0  8  8  3  7  7

In [59]:
pd.DataFrame(np.sort(df.values))

   0  1  2  3  4
0  3  7  7  8  8
1  0  2  2  4  5
2  0  1  2  2  8
3  0  2  4  6  9
4  1  3  4  4  5